app/views/order_mailer/order_mail.html.slim

                td style="font-family:Verdana,Arial;font-weight:normal;border-collapse:collapse;vertical-align:top;padding:10px 15px;margin:0;border-top:1px solid #ebebeb;text-align:left"
                  p = @order.order_items.first.movie_theater.movie.name
                td style="font-family:Verdana,Arial;font-weight:normal;border-collapse:collapse;vertical-align:top;padding:10px 15px;margin:0;border-top:1px solid #ebebeb;text-align:left"
                  = @order.order_items.first.movie_theater.theater.name
                  br
                  = @order.order_items.first.movie_theater.room.name
                td style="font-family:Verdana,Arial;font-weight:normal;border-collapse:collapse;vertical-align:top;padding:10px 15px;margin:0;border-top:1px solid #ebebeb;text-align:left"
                  = @order.order_items.first.movie_theater.time.strftime("%d/%m/%Y, %H:%M")
                td style="font-family:Verdana,Arial;font-weight:normal;border-collapse:collapse;vertical-align:top;padding:10px 15px;margin:0;border-top:1px solid #ebebeb;text-align:left"
                  - @order.order_items.each do |item|
---
SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 3 ORDER BY `order_items`.`id` ASC LIMIT 1
SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 4 ORDER BY `order_items`.`id` ASC LIMIT 1
SELECT  `theaters`.* FROM `theaters` WHERE `theaters`.`id` = 1 LIMIT 1
SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 ORDER BY `order_items`.`id` ASC LIMIT 1
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 4