app/controllers/billings_controller.rb

UPDATE `users` SET `stripe_id` = 'cus_LPo3NJYsRoxjya', `updated_at` = '2022-03-30 10:08:05' WHERE `users`.`id` = 3
---
  def create_card
    respond_to do |format|
      if current_user.stripe_id.nil?
        customer = Stripe::Customer.create("email": current_user.email)
        current_user.update(stripe_id: customer.id)

SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 3 ORDER BY `orders`.`id` DESC LIMIT 1
SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 ORDER BY `order_items`.`id` ASC LIMIT 1
---
  def success
    @order = current_user.orders.last
    @order_items = @order.order_items

SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 3 ORDER BY `orders`.`id` DESC LIMIT 1
UPDATE `orders` SET `order_status` = TRUE, `chart` = 'https://chart.googleapis.com/chart?cht=qr&chl=1&chs=200x200&chld=L%7C4', `updated_at` = '2022-03-30 10:08:14' WHERE `orders`.`id` = 1
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 5 ORDER BY `order_items`.`id` ASC LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 5 LIMIT 1
SELECT  `theaters`.* FROM `theaters` WHERE `theaters`.`id` = 1 LIMIT 1
---
  def payment
    customer = Stripe::Customer.new current_user.stripe_id
    order = current_user.orders.last
    @payment = Stripe::Charge.create customer: customer.id,
                                     amount: order.total / 10,
                                     description: "Payments",
                                     currency: "vnd"
    @payment.save
    order.order_status = true
    order.chart = order.generate_qr
    order.save
    # OrderMailer.order_mail(order, current_user).deliver_now if current_user.present?
    order.order_email_send
    qr_code_img = RQRCode::QRCode.new(order.id.to_s, level: :h).to_img.resize(200, 200)
    order.update_attribute :image, qr_code_img.to_string
    paid_seats = order.order_items.first.movie_theater.showtime_seats
                      .where(seat_id: order.order_items.pluck(:seat_id))
    paid_seats.each do |seat|