app/controllers/orders_controller.rb

INSERT INTO `order_items` (`movie_theater_id`, `order_id`, `seat_id`, `created_at`, `updated_at`) VALUES (1, 1, 11, '2022-03-30 02:38:45', '2022-03-30 02:38:45')
INSERT INTO `orders` (`user_id`, `total`, `created_at`, `updated_at`) VALUES (3, 100000.0, '2022-03-30 02:38:45', '2022-03-30 02:38:45')
---
  def create
    @order = Order.new order_params
    if @order.save && @order.order_items.present?

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 ORDER BY `order_items`.`id` ASC LIMIT 1
---
  def show
    @order = Order.find params[:id]
    @order_items = @order.order_items

SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 5 ORDER BY `orders`.`created_at` DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `orders` WHERE `orders`.`user_id` = 5
---
  def index
    @orders = Order.where(user_id: current_user.id).order(created_at: :desc).page(params[:page]).per Settings.per_page_orders

SELECT  `theaters`.* FROM `theaters` WHERE `theaters`.`id` = 1 LIMIT 1
SELECT  `movie_theaters`.* FROM `movie_theaters` WHERE `movie_theaters`.`id` = 1 LIMIT 1
---
  def find_movie_theater
    @movie_theater = MovieTheater.find params[:movie_theater_id]

SELECT `seats`.`id`, `seats`.`name`, `seats`.`available` FROM `seats` WHERE `seats`.`room_id` = 1
---
  def identify_room
    @room = @movie_theater.room
    @seats = @room.seats.pluck(:id, :name, :available)

SELECT `showtime_seats`.`seat_id` FROM `showtime_seats` WHERE `showtime_seats`.`movie_theater_id` = 1 AND `showtime_seats`.`seat_available` = FALSE
---
  def find_picked_seats
    @picked_seat_array = ShowtimeSeat.where(movie_theater_id:
      params[:movie_theater_id], seat_available: false).pluck(:seat_id)