app/controllers/static_pages_controller.rb

  def home
    @movies = Movie.last Settings.amount_movie_index
---
SELECT  `movies`.* FROM `movies` ORDER BY `movies`.`id` DESC LIMIT 8

  def schedule
    @theater = Theater.find params[:theater]
    date = params[:date]
    @movie_theaters = @theater.movie_theaters.date_like date
    @movies = @movie_theaters.pluck(:movie_id).uniq.map { |id| Movie.find(id) }
---
SELECT  `theaters`.* FROM `theaters` WHERE `theaters`.`id` = 1 LIMIT 1
SELECT `movie_theaters`.`movie_id` FROM `movie_theaters` WHERE `movie_theaters`.`theater_id` = 1 AND (time LIKE '%2022-03-30%')

  def date
    @movie = Movie.find params[:movie]
    @dates = @movie.movie_theaters.pluck(:time).map(&:to_date).uniq
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
SELECT `movie_theaters`.`time` FROM `movie_theaters` WHERE `movie_theaters`.`movie_id` = 1

  def show_city
    movie_theaters = Movie.find(params[:movie]).movie_theaters.date_like(params[:date])
    theater_ids = movie_theaters.pluck(:theater_id).uniq
    city_ids = Theater.where(id: theater_ids).pluck(:city_id)
    @cities = City.where(id: city_ids)
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
SELECT `movie_theaters`.`theater_id` FROM `movie_theaters` WHERE `movie_theaters`.`movie_id` = 1 AND (time LIKE '%2022-03-30%')
SELECT `theaters`.`city_id` FROM `theaters` WHERE `theaters`.`id` = 1
SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1

  def show_theater
    theater_ids = MovieTheater.movie_like(params[:movie].to_i).pluck(:theater_id).uniq
    theaters = Theater.where(id: theater_ids)
    @theaters = []
    theaters.each do |theater|
---
SELECT `movie_theaters`.`theater_id` FROM `movie_theaters` WHERE (movie_id = '1')
SELECT `theaters`.* FROM `theaters` WHERE `theaters`.`id` = 1

  def show_showtime
    @movie_theaters = Theater.find(params[:theater]).movie_theaters
                             .where(movie_id: params[:movie].to_i)
                             .where("date > ?", Date.today)
                             .date_like(params[:date]).order(time: :asc)
---
SELECT `movie_theaters`.* FROM `movie_theaters` WHERE `movie_theaters`.`theater_id` = 1 AND `movie_theaters`.`movie_id` = 1 AND (time LIKE '%2022-03-30%') ORDER BY `movie_theaters`.`time` ASC